FYI, the workaround does not seem to work when deploying into a non-AZ enabled region.  
Here is what happen when I try to deploy on ukwest. 

   advanced = {
      custom_settings_by_resource_type = {
        azurerm_public_ip = {
          connectivity_vpn = {
            ukwest = {
              sku = "Standard" 
              allocation_method = "Static"
            },
            uksouth = {
              sku = "Standard"
              allocation_method = "Static"
            }
          }
        },  

Only the first pip is setup with Standard. It seems the custom settings is not applying to the second pip (pip2 below). Seems to be potentially another bug with custom settings ? 

  # module.caf-enterprise-scale.azurerm_public_ip.connectivity["/subscriptions/2560ed2d-c2de-48d7-b953-cb112107a0f5/resourceGroups/dev-connectivity-ukwest/providers/Microsoft.Network/publicIPAddresses/dev-vpngw-ukwest-pip"] will be created
  + resource "azurerm_public_ip" "connectivity" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "ukwest"
      + name                    = "dev-vpngw-ukwest-pip"
      + resource_group_name     = "dev-connectivity-ukwest"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "demo_type"  = "deploy_connectivity_resources_custom"
          + "deployedBy" = "terraform/azure/caf-enterprise-scale"
        }
    }

  # module.caf-enterprise-scale.azurerm_public_ip.connectivity["/subscriptions/2560ed2d-c2de-48d7-b953-cb112107a0f5/resourceGroups/dev-connectivity-ukwest/providers/Microsoft.Network/publicIPAddresses/dev-vpngw-ukwest-pip2"] will be created
  + resource "azurerm_public_ip" "connectivity" {
      + allocation_method       = "Dynamic"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "ukwest"
      + name                    = "dev-vpngw-ukwest-pip2"
      + resource_group_name     = "dev-connectivity-ukwest"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "demo_type"  = "deploy_connectivity_resources_custom"
          + "deployedBy" = "terraform/azure/caf-enterprise-scale"
        }
    }

  # module.caf-enterprise-scale.azurerm_virtual_network_gateway.connectivity["/subscriptions/2560ed2d-c2de-48d7-b953-cb112107a0f5/resourceGroups/dev-connectivity-ukwest/providers/Microsoft.Network/virtualNetworkGateways/dev-vpngw-ukwest"] will be created
  + resource "azurerm_virtual_network_gateway" "connectivity" {
      + active_active                         = true
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = true
      + generation                            = "Generation1"
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "ukwest"
      + name                                  = "dev-vpngw-ukwest"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "dev-connectivity-ukwest"
      + sku                                   = "VpnGw1"
      + tags                                  = {
          + "demo_type"  = "deploy_connectivity_resources_custom"
          + "deployedBy" = "terraform/azure/caf-enterprise-scale"
        }
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + ip_configuration {
          + name                          = "dev-vpngw-ukwest-pip"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = "/subscriptions/2560ed2d-c2de-48d7-b953-cb112107a0f5/resourceGroups/dev-connectivity-ukwest/providers/Microsoft.Network/publicIPAddresses/dev-vpngw-ukwest-pip" 
          + subnet_id                     = "/subscriptions/2560ed2d-c2de-48d7-b953-cb112107a0f5/resourceGroups/dev-connectivity-ukwest/providers/Microsoft.Network/virtualNetworks/dev-hub-ukwest/subnets/GatewaySubnet"
        }
      + ip_configuration {
          + name                          = "dev-vpngw-ukwest-pip2"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = "/subscriptions/2560ed2d-c2de-48d7-b953-cb112107a0f5/resourceGroups/dev-connectivity-ukwest/providers/Microsoft.Network/publicIPAddresses/dev-vpngw-ukwest-pip2"
          + subnet_id                     = "/subscriptions/2560ed2d-c2de-48d7-b953-cb112107a0f5/resourceGroups/dev-connectivity-ukwest/providers/Microsoft.Network/virtualNetworks/dev-hub-ukwest/subnets/GatewaySubnet"
        }
    }